---
kind: type
id: T:Autodesk.Revit.DB.Visual.MetallicpaintFinishType
source: html/993143b4-6de0-fdfb-b2b1-9d8fa7dc498e.htm
---
# Autodesk.Revit.DB.Visual.MetallicpaintFinishType

The enumerated type representing the permitted values for the asset property "MetallicpaintFinish" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public enum MetallicpaintFinishType
```